04-deep-learning/01-teoria/modelado-avanzado-docs/teoria/LSTM.org
#+TITLE:
#+AUTHOR:
#+EMAIL:
#+DATE:
#+OPTIONS: texht:t toc:3 num:3 -:nil ^:{} ":nil ':nil
#+OPTIONS: tex:t
#+LATEX_CLASS: article
#+LATEX_HEADER:
#+LANGUAGE: es

#+BEGIN_COMMENT
#+LATEX_HEADER: \usepackage[AUTO]{babel}
#+END_COMMENT

#+LATEX_HEADER_EXTRA: \usepackage{mdframed}
#+LATEX_HEADER_EXTRA: \BeforeBeginEnvironment{minted}{\begin{mdframed}}
#+LATEX_HEADER_EXTRA: \AfterEndEnvironment{minted}{\end{mdframed}}

#+LATEX: \setlength\parindent{10pt}
#+LATEX_HEADER: \usepackage{parskip}

#+latex_header: \usepackage[utf8]{inputenc} %% For unicode chars
#+LATEX_HEADER: \usepackage{placeins}

#+LATEX_HEADER: \usepackage[margin=2.50cm]{geometry}

#+LaTeX_HEADER: \usepackage[T1]{fontenc}
#+LaTeX_HEADER: \usepackage{mathpazo}
#+LaTeX_HEADER: \linespread{1.05}
#+LaTeX_HEADER: \usepackage[scaled]{helvet}
#+LaTeX_HEADER: \usepackage{courier}

#+LaTeX_HEADER: \hypersetup{colorlinks=true,linkcolor=blue}
#+LATEX_HEADER: \RequirePackage{fancyvrb}
#+LATEX_HEADER: \DefineVerbatimEnvironment{verbatim}{Verbatim}{fontsize=\small,formatcom = {\color[rgb]{0.5,0,0}}}


* Introducción a las series temporales y el aprendizaje profundo
Las series temporales son una secuencia de datos que se han
recolectado a lo largo del tiempo. Estos datos pueden ser medidas de
temperatura, precios de acciones, número de ventas, o cualquier otro
tipo de dato que se recolecte en intervalos de tiempo regulares. Las
series temporales son diferentes a otros tipos de datos porque su
orden y tiempo son esenciales para el análisis. El objetivo del
análisis de series temporales es encontrar patrones y tendencias en
los datos que puedan ser utilizados para hacer predicciones precisas
sobre el futuro.

En los últimos años, el aprendizaje profundo ha revolucionado la forma
en que se analizan las series temporales. Las redes neuronales
recurrentes (RNN) son una arquitectura de aprendizaje profundo que se
utiliza ampliamente en el análisis de series temporales. Las RNN son
capaces de procesar datos secuenciales y utilizar la información
anterior para influir en las predicciones futuras.

Una de las variantes más populares de las RNN son las redes LSTM (Long
Short-Term Memory), que se han utilizado con éxito en el análisis de
series de tiempo debido a su capacidad para aprender a largo plazo y
mantener la información relevante a lo largo del tiempo.

En el siguiente apartado, nos centraremos en las redes LSTM y cómo se
pueden aplicar al análisis de la calidad del aire en series
temporales.

===================

El análisis de series de tiempo es una técnica estadística que se
ocupa de datos que se recopilan a intervalos regulares en el
tiempo. El objetivo del análisis de series de tiempo es extraer ideas
y patrones significativos de los datos, que se pueden utilizar para la
toma de decisiones y la predicción.

El aprendizaje profundo es un subconjunto del aprendizaje automático
que utiliza redes neuronales con múltiples capas para aprender
relaciones complejas entre entradas y salidas. Estas redes neuronales
son capaces de aprender y modelar relaciones no lineales, lo que las
hace adecuadas para el análisis de series de tiempo.

Un tipo popular de red neuronal utilizado para el análisis de series
de tiempo es la red neuronal recurrente (RNN). Las RNN están diseñadas
para manejar datos secuenciales y pueden tener en cuenta las
dependencias temporales entre las observaciones. Las redes LSTM
(Memoria a corto y largo plazo) son un tipo específico de RNN que han
demostrado ser especialmente efectivas en la captura de dependencias a
largo plazo en los datos de series de tiempo.

Al combinar el poder del aprendizaje profundo con las ideas
proporcionadas por el análisis de series de tiempo, es posible
construir modelos potentes que pueden predecir con precisión las
tendencias futuras y tomar decisiones informadas basadas en datos
históricos.


** LSTM
Una de las variantes más eficientes y populares de las redes
neuronales recurrentes (RNN) son las redes LSTM (Long Short-Term
Memory). Las LSTM fueron introducidas para resolver algunos de los
desafíos de las RNN estándar, como la dificultad de aprender
dependencias a largo plazo en datos secuenciales.

Las redes LSTM cuentan con una arquitectura única que incluye
compuertas de entrada, olvido y salida, así como un estado de celda
que permite almacenar información relevante durante periodos
prolongados. Este diseño avanzado les otorga la capacidad de aprender
patrones complejos en datos de series temporales, lo que las hace
ideales para aplicaciones como el procesamiento de lenguaje natural,
la predicción financiera y el análisis de secuencias en general.

A pesar de que las LSTM tienen un número mayor de parámetros en
comparación con las GRU, su capacidad para manejar dependencias más
largas y su flexibilidad han hecho que sean ampliamente adoptadas en
una variedad de tareas donde la precisión es crítica.

En el siguiente apartado, nos centraremos en las redes LSTM y cómo se
pueden aplicar al análisis de la calidad del aire en series
temporales.
*** Arquitectura redes LSTM

Las redes LSTM (Long Short-Term Memory) son un tipo especial de redes
neuronales recurrentes diseñadas para manejar dependencias a largo
plazo en datos secuenciales. Su estructura incluye componentes clave
que trabajan juntos para procesar y almacenar información de manera
eficiente:

1. **Celdas de memoria**: Son el núcleo de las LSTM y se encargan de
   almacenar información relevante durante largos periodos de
   tiempo. Estas celdas permiten que la red decida qué información
   conservar o descartar.

2. **Puertas**:
   - **Puerta de entrada**: Controla qué información nueva se almacena
     en la celda de memoria.
   - **Puerta de olvido**: Decide qué información existente en la
     celda debe ser eliminada.
   - **Puerta de salida**: Determina qué parte de la información
     almacenada en la celda se utiliza para la salida actual.

3. **Estados**:
   - **Estado de celda**: Es una línea de flujo que transporta
     información a lo largo de la red, con interacciones mínimas.
   - **Estado oculto**: Proporciona información al siguiente paso de
     tiempo y a la salida.

Estas características hacen que las LSTM sean ideales para tareas como
procesamiento de lenguaje natural, reconocimiento de voz y predicción
de series temporales.

