04-deep-learning/01-teoria/modelado-avanzado-docs/teoria/LSTM.tex
% Created 2025-04-21 lun 17:09
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}

\usepackage{parskip}
\usepackage[utf8]{inputenc} %% For unicode chars
\usepackage{placeins}
\usepackage[margin=2.50cm]{geometry}
\usepackage[T1]{fontenc}
\usepackage{mathpazo}
\linespread{1.05}
\usepackage[scaled]{helvet}
\usepackage{courier}
\hypersetup{colorlinks=true,linkcolor=blue}
\RequirePackage{fancyvrb}
\DefineVerbatimEnvironment{verbatim}{Verbatim}{fontsize=\small,formatcom = {\color[rgb]{0.5,0,0}}}
\usepackage{mdframed}
\BeforeBeginEnvironment{minted}{\begin{mdframed}}
\AfterEndEnvironment{minted}{\end{mdframed}}
\setcounter{secnumdepth}{3}
\date{}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.6.18)}, 
 pdflang={Spanish}}
\begin{document}

\setcounter{tocdepth}{3}
\tableofcontents

\setlength\parindent{10pt}


\section{Introducción a las series temporales y el aprendizaje profundo}
\label{sec:org1295288}
Las series temporales son una secuencia de datos que se han
recolectado a lo largo del tiempo. Estos datos pueden ser medidas de
temperatura, precios de acciones, número de ventas, o cualquier otro
tipo de dato que se recolecte en intervalos de tiempo regulares. Las
series temporales son diferentes a otros tipos de datos porque su
orden y tiempo son esenciales para el análisis. El objetivo del
análisis de series temporales es encontrar patrones y tendencias en
los datos que puedan ser utilizados para hacer predicciones precisas
sobre el futuro.

En los últimos años, el aprendizaje profundo ha revolucionado la forma
en que se analizan las series temporales. Las redes neuronales
recurrentes (RNN) son una arquitectura de aprendizaje profundo que se
utiliza ampliamente en el análisis de series temporales. Las RNN son
capaces de procesar datos secuenciales y utilizar la información
anterior para influir en las predicciones futuras.

Una de las variantes más populares de las RNN son las redes LSTM (Long
Short-Term Memory), que se han utilizado con éxito en el análisis de
series de tiempo debido a su capacidad para aprender a largo plazo y
mantener la información relevante a lo largo del tiempo.

En el siguiente apartado, nos centraremos en las redes LSTM y cómo se
pueden aplicar al análisis de la calidad del aire en series
temporales.

\texttt{=================}

El análisis de series de tiempo es una técnica estadística que se
ocupa de datos que se recopilan a intervalos regulares en el
tiempo. El objetivo del análisis de series de tiempo es extraer ideas
y patrones significativos de los datos, que se pueden utilizar para la
toma de decisiones y la predicción.

El aprendizaje profundo es un subconjunto del aprendizaje automático
que utiliza redes neuronales con múltiples capas para aprender
relaciones complejas entre entradas y salidas. Estas redes neuronales
son capaces de aprender y modelar relaciones no lineales, lo que las
hace adecuadas para el análisis de series de tiempo.

Un tipo popular de red neuronal utilizado para el análisis de series
de tiempo es la red neuronal recurrente (RNN). Las RNN están diseñadas
para manejar datos secuenciales y pueden tener en cuenta las
dependencias temporales entre las observaciones. Las redes LSTM
(Memoria a corto y largo plazo) son un tipo específico de RNN que han
demostrado ser especialmente efectivas en la captura de dependencias a
largo plazo en los datos de series de tiempo.

Al combinar el poder del aprendizaje profundo con las ideas
proporcionadas por el análisis de series de tiempo, es posible
construir modelos potentes que pueden predecir con precisión las
tendencias futuras y tomar decisiones informadas basadas en datos
históricos.


\subsection{LSTM}
\label{sec:org3b77349}
Una de las variantes más eficientes y populares de las redes
neuronales recurrentes (RNN) son las redes LSTM (Long Short-Term
Memory). Las LSTM fueron introducidas para resolver algunos de los
desafíos de las RNN estándar, como la dificultad de aprender
dependencias a largo plazo en datos secuenciales.

Las redes LSTM cuentan con una arquitectura única que incluye
compuertas de entrada, olvido y salida, así como un estado de celda
que permite almacenar información relevante durante periodos
prolongados. Este diseño avanzado les otorga la capacidad de aprender
patrones complejos en datos de series temporales, lo que las hace
ideales para aplicaciones como el procesamiento de lenguaje natural,
la predicción financiera y el análisis de secuencias en general.

A pesar de que las LSTM tienen un número mayor de parámetros en
comparación con las GRU, su capacidad para manejar dependencias más
largas y su flexibilidad han hecho que sean ampliamente adoptadas en
una variedad de tareas donde la precisión es crítica.

En el siguiente apartado, nos centraremos en las redes LSTM y cómo se
pueden aplicar al análisis de la calidad del aire en series
temporales.
\subsubsection{Arquitectura redes LSTM}
\label{sec:orgc1abb98}

Las redes LSTM (Long Short-Term Memory) son un tipo especial de redes
neuronales recurrentes diseñadas para manejar dependencias a largo
plazo en datos secuenciales. Su estructura incluye componentes clave
que trabajan juntos para procesar y almacenar información de manera
eficiente:

\begin{enumerate}
\item \textbf{\textbf{Celdas de memoria}}: Son el núcleo de las LSTM y se encargan de
almacenar información relevante durante largos periodos de
tiempo. Estas celdas permiten que la red decida qué información
conservar o descartar.

\item \textbf{\textbf{Puertas}}:
\begin{itemize}
\item \textbf{\textbf{Puerta de entrada}}: Controla qué información nueva se almacena
en la celda de memoria.
\item \textbf{\textbf{Puerta de olvido}}: Decide qué información existente en la
celda debe ser eliminada.
\item \textbf{\textbf{Puerta de salida}}: Determina qué parte de la información
almacenada en la celda se utiliza para la salida actual.
\end{itemize}

\item \textbf{\textbf{Estados}}:
\begin{itemize}
\item \textbf{\textbf{Estado de celda}}: Es una línea de flujo que transporta
información a lo largo de la red, con interacciones mínimas.
\item \textbf{\textbf{Estado oculto}}: Proporciona información al siguiente paso de
tiempo y a la salida.
\end{itemize}
\end{enumerate}

Estas características hacen que las LSTM sean ideales para tareas como
procesamiento de lenguaje natural, reconocimiento de voz y predicción
de series temporales.
