04-deep-learning/01-teoria/modelado-avanzado-docs/teoria/LSTM.org
*** Funcionamiento red LSTM
Las redes LSTM (Long Short-Term Memory) funcionan gestionando el flujo
de información a través de pasos temporales en datos secuenciales. A
continuación te explico su funcionamiento de manera más clara:

1. **Procesamiento inicial**: En cada paso de tiempo, la LSTM recibe
   la entrada actual, el estado oculto y el estado de celda del paso
   anterior.

2. **Puerta de olvido**: Determina si se debe eliminar información del
   estado de celda. Esto se hace a través de una función sigmoide que
   evalúa la relevancia de cada elemento del estado anterior.

3. **Puerta de entrada**: Decide qué nueva información se debe agregar
   al estado de celda. Aplica una función sigmoide para filtrar la
   entrada y una función tangente hiperbólica para generar valores
   candidatos.

4. **Actualización del estado de celda**: El estado de celda se
   actualiza combinando la información conservada de la puerta de
   olvido y la nueva información de la puerta de entrada.

5. **Puerta de salida**: Utiliza el estado de celda actualizado para
   calcular el estado oculto que se enviará al siguiente paso temporal
   y se usará como salida. También utiliza una función sigmoide para
   filtrar información relevante.

Gracias a esta arquitectura, las redes LSTM son capaces de recordar
información importante durante largos periodos y descartar datos
irrelevantes. Esto las hace ideales para tareas como traducción
automática, análisis de sentimientos y predicción de series
temporales.

*** Preparación de los datos
Una preparación adecuada de los datos es esencial para cualquier
análisis de series temporales. Aquí hay algunos pasos que se pueden
tomar para preparar los datos de series temporales para el análisis:

- Manejo de datos faltantes: Los datos de series temporales a menudo
  contienen valores faltantes, que pueden ocurrir debido a varias
  razones como fallas en el equipo o errores de entrada de datos. Es
  importante manejar los datos faltantes adecuadamente, ya que puede
  afectar la precisión del análisis. Los métodos comunes para manejar
  datos faltantes incluyen la interpolación, la imputación y la
  eliminación.

- Transformación de datos: Los datos de series temporales pueden
  necesitar ser transformados para hacerlos estacionarios o para
  mejorar su normalidad. Las transformaciones de datos comunes
  incluyen la toma del logaritmo, la raíz cuadrada o la diferencia de
  los datos.

- Normalización: La normalización es el proceso de escalar los datos a
  un rango común. Esto se hace a menudo para asegurarse de que todas
  las variables tengan igual peso en el análisis. Las técnicas de
  normalización comunes incluyen la normalización mín-máx y la
  normalización z-score.

- Selección de características: La selección de características es el
  proceso de seleccionar variables relevantes para el análisis. Esto
  se puede hacer utilizando conocimiento del dominio o utilizando
  técnicas estadísticas como el análisis de correlación o el análisis
  de componentes principales.

*** Creación y entrenamiento de un red LSTM
Breve guía sobre cómo crear y entrenar una red LSTM para el análisis
de series temporales:

1. **Configurar la arquitectura de la red**: El primer paso para crear
   una red LSTM es configurar la arquitectura de la red. Esto implica
   especificar el número de capas, el número de neuronas en cada capa
   y el tipo de función de activación a utilizar. La arquitectura de
   la red dependerá del problema específico que se esté abordando y
   puede requerir algo de experimentación para encontrar la
   configuración óptima.

2. **Seleccionar hiperparámetros**: Los hiperparámetros son parámetros
   que no son aprendidos por el modelo, sino que son establecidos por
   el usuario antes del entrenamiento. Los hiperparámetros comunes
   para las redes LSTM incluyen la tasa de aprendizaje, el tamaño del
   lote (batch size) y el número de épocas. Estos hiperparámetros
   pueden tener un impacto significativo en el rendimiento del modelo
   y pueden requerir cierto ajuste para encontrar los valores óptimos.

3. **Preparar los datos**: Antes de entrenar la red LSTM, los datos
   deben prepararse en un formato que pueda alimentarse en la
   red. Esto implica dividir los datos en conjuntos de entrenamiento y
   prueba, normalizar los datos y remodelarlos en un tensor 3D con
   forma (muestras, pasos de tiempo, características).

4. **Entrenar el modelo**: Una vez que se han especificado la
   arquitectura de la red y los hiperparámetros, y se han preparado
   los datos, la red LSTM puede entrenarse usando la retropropagación
   a través del tiempo (BPTT). Esto implica alimentar los datos de
   entrenamiento en la red y actualizar los pesos utilizando el
   descenso de gradiente para minimizar la función de pérdida.

Siguiendo estos pasos, se puede crear y entrenar una red LSTM para el
análisis de series temporales. Es importante tener en cuenta que la
construcción de un modelo LSTM efectivo a menudo requiere cierta
experimentación y ajuste fino para lograr resultados óptimos.

**** Ejemplo en Python con Keras
Aquí hay un ejemplo de cómo usar una red LSTM para el análisis de
series de tiempo en Python:
#+begin_src python
import numpy as np
from keras.models import Sequential
from keras.layers import LSTM, Dense

# preparar datos
data = np.random.rand(1000, 1) # generar datos aleatorios
timesteps = 10 # número de pasos de tiempo para usar en la entrada
X = np.zeros((data.shape[0]-timesteps, timesteps, data.shape[1]))
y = np.zeros((data.shape[0]-timesteps, data.shape[1]))
for i in range(timesteps, data.shape[0]):
    X[i-timesteps] = data[i-timesteps:i]
    y[i-timesteps] = data[i]

# dividir en conjuntos de entrenamiento y prueba
train_size = int(X.shape[0] * 0.8)
X_train, X_test = X[:train_size], X[train_size:]
y_train, y_test = y[:train_size], y[train_size:]

# crear red LSTM
model = Sequential()
model.add(LSTM(16, input_shape=(timesteps, data.shape[1])))
model.add(Dense(data.shape[1]))
model.compile(loss='mean_squared_error', optimizer='adam')

# entrenar el modelo
model.fit(X_train, y_train, epochs=100, batch_size=32)

# evaluar el modelo
mse = model.evaluate(X_test, y_test)
print('MSE de prueba:', mse)
#+end_src

