04-deep-learning/01-teoria/modelado-avanzado-docs/teoria/LSTM.tex

# Datos ficticios de entrada (batch_size, time_steps, features)
# 100 muestras, 10 pasos de tiempo, 8 características
x = torch.randn(100, 10, 8)
# Salida con 1 característica
y = torch.randn(100, 1)

dataset = TensorDataset(x, y)
dataloader = DataLoader(dataset, batch_size=16, shuffle=True)

class LSTMModel(nn.Module):
   def __init__(self):
       super().__init__()
       self.lstm = nn.LSTM(input_size=8, hidden_size=64, batch_first=True)
       self.fc = nn.Linear(64, 1)

   def forward(self, x):
       out, _ = self.lstm(x)
       # Tomamos el último paso de tiempo
       return self.fc(out[:, -1, :])

model = LSTMModel()
criterion = nn.MSELoss()
optimizer = torch.optim.Adam(model.parameters(), lr=0.001)

# Entrenamiento
for epoch in range(10):
    for batch_x, batch_y in dataloader:
        optimizer.zero_grad()
        output = model(batch_x)
        loss = criterion(output, batch_y)
        loss.backward()
        optimizer.step()
    print(f"Epoch {epoch + 1}, Loss: {loss.item():.4f}")
\end{minted}


Los ejemplos crean una red LSTM simple con una capa LSTM y una capa de
salida densa. La red se entrena con datos generados aleatoriamente y
se evalúa en un conjunto de prueba. El error cuadrático medio (MSE) se
calcula para medir el rendimiento del modelo.

Este es solo un ejemplo simple para ilustrar cómo se puede utilizar
una red LSTM para el análisis de series de tiempo en Python. En la
práctica, la preparación de datos y la arquitectura del modelo
tendrían que adaptarse al problema específico que se está abordando.
\end{itemize}

\subsubsection{Evaluación del modelo}
\label{sec:org89eb3a0}
Vamos a ver, brevemente, cómo evaluar un modelo LSTM para análisis de
series de tiempo:

\begin{enumerate}
\item \textbf{\textbf{Visualización de resultados}}: Una forma de evaluar el
rendimiento de un modelo LSTM es visualizar los valores predichos
frente a los valores reales. Esto se puede hacer usando un gráfico
de líneas, con los valores reales representados en un color y los
valores predichos representados en otro color. Esto le permite
evaluar visualmente qué tan bien el modelo está capturando las
tendencias y patrones en los datos.

\item \textbf{\textbf{Cálculo de métricas de rendimiento}}: Otra forma de evaluar el
rendimiento de un modelo LSTM es calcular métricas de rendimiento
como el error cuadrático medio (MSE) o el error absoluto medio
(MAE). Estas métricas proporcionan una medida cuantitativa de qué
tan bien el modelo está funcionando, con valores más bajos que
indican un mejor rendimiento.

\item \textbf{\textbf{Comparación con modelos de referencia}}: También puede ser útil
comparar el rendimiento del modelo LSTM con modelos de referencia
como un pronóstico ingenuo o un promedio móvil simple. Esto
proporciona un punto de referencia para evaluar el rendimiento del
modelo LSTM y puede ayudar a determinar si la complejidad adicional
del modelo LSTM está justificada.
\end{enumerate}

Siguiendo estos pasos, se puede evaluar el rendimiento de un modelo
LSTM en el análisis de series de tiempo. Es importante tener en cuenta
que diferentes problemas pueden requerir diferentes métodos y métricas
de evaluación, por lo que es importante elegir los métodos adecuados
para el problema específico que se está abordando.

\begin{itemize}
\item Código para evaluar el modelo
\label{sec:org89679bf}
Ejemplo de cómo evaluar un modelo LSTM para el análisis de series
temporales en Python, basado en el ejemplo anterior:
\begin{minted}[]{python}
import matplotlib.pyplot as plt

# generar predicciones
y_pred = model.predict(X_test)

# visualizar resultados
plt.plot(y_test, label='Actual')
plt.plot(y_pred, label='Predicted')
plt.legend()
plt.show()

# calcular métricas de rendimiento
mse = np.mean((y_test - y_pred)**2)
mae = np.mean(np.abs(y_test - y_pred))
print('MSE:', mse)
print('MAE:', mae)

# comparar con el modelo base (pronóstico ingenuo)
y_naive = y_test[:-1]
mse_naive = np.mean((y_test[1:] - y_naive)**2)
print('Naive MSE:', mse_naive)
\end{minted}

\begin{minted}[]{python}
import matplotlib.pyplot as plt
import torch
import numpy as np

# Generar predicciones
model.eval()  # Cambiar el modelo al modo de evaluación
with torch.no_grad():
    # Convertimos las predicciones en formato NumPy
    y_pred = model(X_test).numpy()
    # Aseguramos que los datos reales estén en formato NumPy
    y_test = y_test.numpy()

# Visualizar resultados
plt.plot(y_test, label='Actual')
plt.plot(y_pred, label='Predicted')
plt.legend()
plt.show()

# Calcular métricas de rendimiento
mse = np.mean((y_test - y_pred) ** 2)
mae = np.mean(np.abs(y_test - y_pred))
print('MSE:', mse)
print('MAE:', mae)

# Comparar con el modelo base (pronóstico ingenuo)
y_naive = y_test[:-1]
mse_naive = np.mean((y_test[1:] - y_naive) ** 2)
print('Naive MSE:', mse_naive)
\end{minted}


El código genera predicciones utilizando el modelo LSTM entrenado y
visualiza los resultados utilizando un gráfico de líneas. Se calcula
el error cuadrático medio (MSE) y el error absoluto medio (MAE) para
proporcionar una medida cuantitativa del rendimiento del modelo. El
rendimiento del modelo LSTM también se compara con un pronóstico
ingenuo, que sirve como modelo base.

Es solo un ejemplo simple para ilustrar cómo se puede evaluar un
modelo LSTM para el análisis de series temporales en Python. En la
práctica, los métodos y métricas de evaluación deberían adaptarse al
problema específico que se está abordando.
\end{itemize}


\subsubsection{Mejorar el modelo}
\label{sec:org2f9c122}
Cómo mejorar y ajustar un modelo LSTM para el análisis de series temporales:

\begin{itemize}
\item Optimización de hiperparámetros: Una forma de mejorar el
rendimiento de un modelo LSTM es optimizar los
hiperparámetros. Esto implica probar sistemáticamente diferentes
combinaciones de hiperparámetros para encontrar los valores que
resulten en el mejor rendimiento. Los hiperparámetros comunes para
optimizar incluyen la tasa de aprendizaje, el tamaño del lote y el
número de épocas.

\item Explorar diferentes arquitecturas de red: Otra forma de mejorar el
rendimiento de un modelo LSTM es explorar diferentes arquitecturas
de red. Esto podría implicar agregar o eliminar capas, cambiar el
número de neuronas en cada capa o usar diferentes tipos de capas,
como capas convolucionales o de abandono.

\item Regularización: La regularización es una técnica utilizada para
evitar el sobreajuste mediante la adición de un término de
penalización a la función de pérdida. Las técnicas de
regularización comunes para las redes LSTM incluyen la
regularización L1 y L2, el abandono y la detención temprana.
\end{itemize}

Siguiendo estos pasos, se puede mejorar y ajustar un modelo LSTM para
obtener un mejor rendimiento en el análisis de series temporales. Es
importante tener en cuenta que mejorar un modelo LSTM a menudo
requiere cierta experimentación y ajuste fino para lograr resultados
óptimos.

\begin{itemize}
\item Código
\label{sec:orgea57ded}
