04-deep-learning/01-teoria/modelado-avanzado-docs/teoria/LSTM.org
**** Código
ejemplo de cómo  mejorar un modelo LSTM para el  análisis de series de
tiempo en Python, basado en los ejemplos anteriores:
#+begin_src python
from keras.layers import Dropout
from keras.callbacks import EarlyStopping

# crear una red LSTM con dropout
model = Sequential()
model.add(LSTM(16, input_shape=(timesteps, data.shape[1])))
model.add(Dropout(0.2))
model.add(Dense(data.shape[1]))
model.compile(loss='mean_squared_error', optimizer='adam')

# entrenar el modelo con early stopping
early_stopping = EarlyStopping(monitor='val_loss', patience=10)
history = model.fit(X_train, y_train, epochs=100, batch_size=32, validation_split=0.2, callbacks=[early_stopping])

# evaluar el modelo
mse = model.evaluate(X_test, y_test)
print('Test MSE:', mse)
#+end_src

Creamos una red LSTM con una capa de dropout para prevenir el
sobreajuste. La red se entrena usando early stopping para detener el
entrenamiento cuando la pérdida de validación deja de mejorar. El
rendimiento del modelo LSTM mejorado se evalúa en el conjunto de
prueba y se compara con los resultados anteriores.

Este es solo un ejemplo simple para ilustrar cómo se puede mejorar un
modelo LSTM para el análisis de series de tiempo en Python. En la
práctica, mejorar un modelo LSTM a menudo requiere experimentación y
ajustes finos para lograr resultados óptimos.

*** Siguientes pasos
Aquí hay una breve guía sobre cómo sacar conclusiones e identificar
los próximos pasos después de construir y evaluar un modelo LSTM para
el análisis de series temporales:

1. **Resumir las conclusiones clave**: Después de construir y evaluar
   un modelo LSTM, es importante resumir las conclusiones clave y las
   ideas obtenidas del análisis. Esto podría incluir un resumen del
   rendimiento del modelo, cualquier patrón o tendencia interesante
   identificada en los datos y cualquier limitación o desafío
   encontrado durante el análisis.

2. **Identificar áreas para una exploración adicional**: La
   construcción de un modelo LSTM para el análisis de series
   temporales a menudo plantea nuevas preguntas y áreas para una
   exploración adicional. Identifique estas áreas y sugiera posibles
   próximos pasos para un análisis adicional. Esto podría incluir la
   exploración de diferentes fuentes de datos, la prueba de diferentes
   arquitecturas de modelo o la aplicación del modelo a nuevos
   problemas o dominios.

3. **Comunicar los resultados**: Finalmente, es importante comunicar
   efectivamente los resultados del análisis a las partes
   interesadas. Esto podría implicar la creación de visualizaciones o
   informes para resumir las conclusiones clave e ideas, y presentar
   los resultados de manera clara y concisa.

Siguiendo estos pasos, se pueden sacar conclusiones del análisis e
identificar los próximos pasos para una exploración adicional o la
aplicación del modelo LSTM.
´


dropout 1
Dropout es una técnica de regularización utilizada para prevenir el
sobreajuste en redes neuronales, incluyendo las redes LSTM. Durante el
entrenamiento, el dropout "elimina" o desactiva de manera aleatoria
una proporción de neuronas en una capa, lo que significa que su
contribución al avance y retroceso temporalmente se elimina. Esto
tiene el efecto de reducir la capacidad de la red y alentarla a
aprender representaciones más robustas de los datos.

En una red LSTM, el dropout se puede aplicar a las entradas, salidas o
conexiones recurrentes de la capa LSTM. Aplicar dropout a las entradas
y salidas se puede hacer utilizando la capa Dropout estándar en la
mayoría de los marcos de aprendizaje profundo. Aplicar dropout a las
conexiones recurrentes requiere el uso de una implementación
especializada de la capa LSTM que admite dropout recurrente.

El Dropout es una técnica poderosa para mejorar el rendimiento de las
redes LSTM y prevenir el sobreajuste. Sin embargo, es importante
ajustar cuidadosamente la tasa de dropout para equilibrar el
compromiso entre la capacidad del modelo y la generalización.



** GRU


Una de las variantes más eficientes y populares de las redes neuronales recurrentes (RNN) son las redes GRU (Gated Recurrent Unit). Las GRU fueron introducidas como una alternativa más simple a las redes LSTM, pero manteniendo muchas de sus ventajas, como la capacidad para aprender dependencias a largo plazo en datos secuenciales.

Las redes GRU simplifican la arquitectura de las LSTM combinando las compuertas de entrada y olvido en una sola compuerta de actualización, y eliminando el estado de celda separado. Esto reduce la cantidad de parámetros del modelo, lo que puede traducirse en tiempos de entrenamiento más cortos y un rendimiento comparable, e incluso superior, en ciertos conjuntos de datos.

Gracias a su diseño más compacto, las redes GRU han demostrado ser especialmente útiles en situaciones donde se dispone de menos datos o cuando el tiempo de entrenamiento es crítico. También son ampliamente utilizadas en tareas de procesamiento de lenguaje natural, series temporales financieras, y análisis de secuencias en general.



*** Estructura y función de las redes GRU
Las GRU son una variante simplificada de las LSTM que también están diseñadas para manejar dependencias a largo plazo en datos secuenciales. Su estructura incluye:

1. **Puertas**:
   - **Puerta de actualización**: Combina las funciones de las puertas de entrada y olvido de las LSTM. Decide cuánto de la información pasada debe mantenerse y cuánto de la nueva información debe incorporarse.
   - **Puerta de reinicio**: Controla cuánto de la información pasada se olvida antes de calcular el nuevo estado.

2. **Estado oculto**:
   - En las GRU, no hay un estado de celda separado como en las LSTM. En su lugar, el estado oculto actúa como el único portador de información a lo largo de los pasos temporales.

Esta simplificación reduce el número de parámetros en comparación con las LSTM, lo que puede hacer que las GRU sean más rápidas de entrenar y menos propensas al sobreajuste en ciertos casos.

---
*** Funcionamiento de las redes GRU
El flujo de información en una GRU se gestiona de la siguiente manera:

1. **Procesamiento inicial**: En cada paso de tiempo, la GRU recibe la entrada actual y el estado oculto del paso anterior.

2. **Cálculo de la puerta de actualización**:
   - La puerta de actualización utiliza una función sigmoide para determinar cuánto de la información pasada debe mantenerse y cuánto de la nueva información debe incorporarse.

3. **Cálculo de la puerta de reinicio**:
   - La puerta de reinicio decide cuánto de la información pasada debe olvidarse antes de calcular el nuevo estado. Esto se hace aplicando una función sigmoide.

4. **Cálculo del estado candidato**:
   - Se genera un estado candidato utilizando la entrada actual y el estado oculto modificado por la puerta de reinicio. Esto se realiza mediante una función tangente hiperbólica.

5. **Actualización del estado oculto**:
   - El estado oculto final se calcula como una combinación ponderada del estado anterior y el estado candidato, utilizando los valores de la puerta de actualización.

Gracias a esta arquitectura más simple, las GRU son eficaces para tareas como procesamiento de lenguaje natural, reconocimiento de voz y predicción de series temporales, al igual que las LSTM, pero con menor complejidad computacional.

En el siguiente apartado, nos centraremos en las redes GRU y cómo se pueden aplicar al análisis de la calidad del aire en series temporales.

---

