04-deep-learning/01-teoria/modelado-avanzado-docs/teoria/LSTM.org
*** Preparación de los datos
La preparación de los datos para una red GRU es similar a la de una red LSTM. Los pasos clave incluyen:

- **Manejo de datos faltantes**: Como en otros modelos de series temporales, es crucial tratar los valores perdidos, utilizando métodos como interpolación, imputación o eliminación de registros, para evitar sesgos o errores en el aprendizaje del modelo.

- **Transformación de datos**: Las transformaciones como el logaritmo, la raíz cuadrada o la diferenciación pueden ser necesarias para estabilizar la varianza o hacer los datos más estacionarios, lo cual es beneficioso para el modelado.

- **Normalización**: Escalar los datos asegura que las diferentes variables tengan igual influencia en el modelo. Las técnicas comunes son la normalización min-max y la estandarización z-score.

- **Selección de características**: Es útil seleccionar variables relevantes para reducir la complejidad del modelo y mejorar el rendimiento. Esto puede hacerse con análisis estadístico o conocimiento del dominio.

*** Creación y entrenamiento de una red GRU
Guía básica para implementar y entrenar una red GRU:

1. **Diseñar la arquitectura**: Se define la estructura de la red, el número de capas GRU, neuronas por capa, funciones de activación y capas adicionales. Las GRU suelen requerir menos parámetros que las LSTM, lo que permite arquitecturas más ligeras.

2. **Elegir hiperparámetros**: Los parámetros como tasa de aprendizaje, tamaño del batch y número de épocas afectan al rendimiento del modelo. Es común usar técnicas como búsqueda en cuadrícula o validación cruzada para ajustarlos.

3. **Preparar los datos**: Los datos se deben convertir en tensores tridimensionales (muestras, pasos temporales, características). Además, se deben dividir en conjuntos de entrenamiento y prueba.

4. **Entrenar el modelo**: Con los datos listos y la arquitectura definida, se entrena la red usando descenso de gradiente y retropropagación a través del tiempo.

*** Ejemplo en Python con Keras
#+begin_src python
import numpy as np
from keras.models import Sequential
from keras.layers import GRU, Dense

# preparar datos
data = np.random.rand(1000, 1)
timesteps = 10
X = np.zeros((data.shape[0]-timesteps, timesteps, data.shape[1]))
y = np.zeros((data.shape[0]-timesteps, data.shape[1]))
for i in range(timesteps, data.shape[0]):
    X[i-timesteps] = data[i-timesteps:i]
    y[i-timesteps] = data[i]

# dividir en entrenamiento y prueba
train_size = int(X.shape[0] * 0.8)
X_train, X_test = X[:train_size], X[train_size:]
y_train, y_test = y[:train_size], y[train_size:]

# crear modelo GRU
model = Sequential()
model.add(GRU(16, input_shape=(timesteps, data.shape[1])))
model.add(Dense(data.shape[1]))
model.compile(loss='mean_squared_error', optimizer='adam')

# entrenar modelo
model.fit(X_train, y_train, epochs=100, batch_size=32)
#+end_src

*** Ejemplo en PyTorch
#+begin_src python
import torch
import torch.nn as nn
from torch.utils.data import DataLoader, TensorDataset

x = torch.randn(100, 10, 8)
y = torch.randn(100, 1)

dataset = TensorDataset(x, y)
dataloader = DataLoader(dataset, batch_size=16, shuffle=True)

class GRUModel(nn.Module):
    def __init__(self):
        super().__init__()
        self.gru = nn.GRU(input_size=8, hidden_size=64, batch_first=True)
        self.fc = nn.Linear(64, 1)

    def forward(self, x):
        out, _ = self.gru(x)
        return self.fc(out[:, -1, :])

model = GRUModel()
criterion = nn.MSELoss()
optimizer = torch.optim.Adam(model.parameters(), lr=0.001)

for epoch in range(10):
    for batch_x, batch_y in dataloader:
        optimizer.zero_grad()
        output = model(batch_x)
        loss = criterion(output, batch_y)
        loss.backward()
        optimizer.step()
    print(f"Epoch {epoch + 1}, Loss: {loss.item():.4f}")
#+end_src

*** Evaluación del modelo
Se evalúa el modelo GRU mediante:

1. **Visualización de resultados**: Comparar las predicciones del modelo con los valores reales mediante gráficos.

2. **Métricas de rendimiento**: Cálculo de métricas como MSE y MAE para cuantificar el rendimiento.

3. **Comparación con modelos base**: Comparar el rendimiento del modelo GRU con modelos sencillos como promedio móvil o pronóstico ingenuo.

*** Mejorar el modelo
Algunas estrategias para optimizar un modelo GRU incluyen:

- **Tuning de hiperparámetros**: Ajustar número de unidades GRU, tasa de aprendizaje, número de épocas, etc.

- **Regularización**: Uso de dropout para prevenir el sobreajuste.

- **Arquitecturas alternativas**: Experimentar con redes GRU bidireccionales o combinarlas con otras capas como convolucionales o de atención.

*** Código con mejoras
#+begin_src python
from keras.layers import Dropout
from keras.callbacks import EarlyStopping

model = Sequential()
model.add(GRU(16, input_shape=(timesteps, data.shape[1])))
model.add(Dropout(0.2))
model.add(Dense(data.shape[1]))
model.compile(loss='mean_squared_error', optimizer='adam')

early_stopping = EarlyStopping(monitor='val_loss', patience=10)
history = model.fit(X_train, y_train, epochs=100, batch_size=32, validation_split=0.2, callbacks=[early_stopping])
#+end_src

*** Siguientes pasos
Después de implementar una red GRU:

1. **Extraer conclusiones**: Analizar los resultados y rendimiento del modelo.

2. **Identificar mejoras futuras**: Evaluar posibles ajustes al modelo, nuevas fuentes de datos o tareas relacionadas.

3. **Comunicar resultados**: Preparar visualizaciones e informes claros para compartir con otros equipos o partes interesadas.

---
